<<<<<<< Updated upstream
print "What is your name?\n"
name = gets
print "Hello " + name
=======
"""Принять имя пользователя как аргумент программы.
Поздороваться с пользователем. Рассмотреть тип строка. получить все
методы, рассмотреть irb режим, включить снимок экрана в отчет.
Разобрать и включить в отчет половину методов с использованием
официальной документации языка. Для решения задачи необходимо
рассмотреть встроенные переменные и константы, включить их в отчет,
рассмотреть способы форматирования сроки, включить в отчет. """

puts "Hello user! Please enter your name: "
name = gets.chomp
print "Nice to meet you #{name}"


>>>>>>> Stashed changes
